Bololololololo/esp32s3/components/gui/gui.cpp
#include <iostream>

#include "esp_log.h"
#include "gui.h"

#include "esp_timer.h"
#include "lvgl.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"

#include "driver/gpio.h"
#include "driver/spi_master.h"

#include "esp_lcd_panel_io_interface.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_ili9341.h"

#include "esp_lvgl_port.h"

#include "driver/i2c_master.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_touch_ft6x36.h"

static const char *TAG = "gui";

#define LCD_HOST SPI2_HOST
#define LCD_H_RES (320)
#define LCD_V_RES (240)
#define LCD_BIT_PER_PIXEL (16)
#define LCD_DRAW_BUFF_HEIGHT (10)
#define LCD_DRAW_BUFF_DOUBLE (false)

#define PIN_NUM_LCD_CS (GPIO_NUM_10)
#define PIN_NUM_LCD_PCLK (GPIO_NUM_12)
#define PIN_NUM_LCD_DATA0 (GPIO_NUM_11)
#define PIN_NUM_LCD_DC (GPIO_NUM_46)
#define PIN_NUM_LCD_RST (GPIO_NUM_18)
#define PIN_NUM_LCD_BL (GPIO_NUM_45)

/* Touch settings */
#define TOUCH_I2C_NUM       (0)
#define TOUCH_I2C_CLK_HZ    (400000)

/* LCD touch pins */
#define TOUCH_I2C_SCL       (GPIO_NUM_15)
#define TOUCH_I2C_SDA       (GPIO_NUM_16)
#define TOUCH_GPIO_INT      (GPIO_NUM_17)
#define TOUCH_GPIO_RST      (GPIO_NUM_18)

/* LVGL display and touch */
static lv_display_t *lvgl_disp = NULL;
static lv_indev_t *lvgl_touch_indev = NULL;
static esp_lcd_panel_io_handle_t lcd_io = NULL;
static esp_lcd_panel_handle_t lcd_panel = NULL;
static i2c_master_bus_handle_t i2c_handle = NULL;
static esp_lcd_panel_io_handle_t tp_io_handle= NULL;
static esp_lcd_touch_handle_t touch_handle = NULL;


static void screen_touch_event_cb(lv_event_t * e)
{
    lv_event_code_t code = lv_event_get_code(e);

    if (code == LV_EVENT_PRESSED || code == LV_EVENT_PRESSING || code == LV_EVENT_RELEASED) {
        ESP_LOGE(TAG, "Screen touch event callback triggered: %d", (int)code);
        ESP_LOGE(TAG, "Screen is being pressed");
        lv_indev_t * indev = (lv_indev_t *)lv_event_get_target(e);
        if (indev) {
            lv_point_t point;
            lv_indev_get_point(indev, &point);
            
            ESP_LOGE(TAG, "Screen Pressed at: X=%d, Y=%d", (int)point.x, (int)point.y);
        }
    }
}

void setup_global_touch_listener(lv_indev_t * indev)
{
    ESP_LOGE(TAG, "Setting up global touch listener");
    // Add event callback to catch drag/touch coordinates globally from the indev
    lv_indev_add_event_cb(indev, screen_touch_event_cb, LV_EVENT_ALL, NULL);
}

static esp_err_t app_lvgl_init(int task_affinity)
{
    /* Initialize LVGL */
    lvgl_port_cfg_t lvgl_cfg = ESP_LVGL_PORT_INIT_CONFIG();
    lvgl_cfg.task_affinity = task_affinity;
    lvgl_cfg.task_max_sleep_ms = 500;
    lvgl_port_init(&lvgl_cfg);

    /* Add LCD screen */
    ESP_LOGD(TAG, "Add LCD screen");
    const lvgl_port_display_cfg_t disp_cfg = {
        .io_handle = lcd_io,
        .panel_handle = lcd_panel,
        .buffer_size = LCD_H_RES * LCD_DRAW_BUFF_HEIGHT,
        .double_buffer = LCD_DRAW_BUFF_DOUBLE,
        .hres = LCD_H_RES,
        .vres = LCD_V_RES,
        .monochrome = false,
        /* Rotation values must be same as used in esp_lcd for initial settings of the screen */
        .rotation = {
            .swap_xy = true,
            .mirror_x = true,
            .mirror_y = true,
        },
        #if LVGL_VERSION_MAJOR >= 9
        .color_format = LV_COLOR_FORMAT_RGB565,
#endif
        .flags = {
            /* Keep the LVGL draw buffer in SPIRAM for this SPI LCD setup.
             * A mixed DMA+SPIRAM request can fall back to internal RAM on some ESP32-S3
             * configurations, so we force SPIRAM and leave DMA off for the render buffer. */
            .buff_dma = false,
            .buff_spiram = true,
#if LVGL_VERSION_MAJOR >= 9
            .swap_bytes = true,
#endif
        }
    };
    ESP_LOGI(TAG, "LVGL draw buffer: SPIRAM=%d DMA=%d size=%u", disp_cfg.flags.buff_spiram, disp_cfg.flags.buff_dma, disp_cfg.buffer_size);
    lvgl_disp = lvgl_port_add_disp(&disp_cfg);

    /* Add touch input (for selected screen) */
    const lvgl_port_touch_cfg_t touch_cfg = {
        .disp = lvgl_disp,
        .handle = touch_handle,
    };
    lvgl_touch_indev = lvgl_port_add_touch(&touch_cfg);

    return ESP_OK;
}

static void app_main_display(void)
{
    /* Task lock */
    lvgl_port_lock(0);


    /* Task unlock */
    lvgl_port_unlock();
}

void Gui::initDisplay(void) {
    ESP_LOGI(TAG, "Turn on the backlight");
    gpio_config_t io_conf = {
        .pin_bit_mask = BIT64(PIN_NUM_LCD_BL),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&io_conf));
    ESP_ERROR_CHECK(gpio_set_level(PIN_NUM_LCD_BL, 1));

    ESP_LOGI(TAG, "Initialize SPI bus");
    const spi_bus_config_t buscfg = {
        .mosi_io_num = PIN_NUM_LCD_DATA0,
        .miso_io_num = -1,
        .sclk_io_num = PIN_NUM_LCD_PCLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = LCD_H_RES * LCD_DRAW_BUFF_HEIGHT * sizeof(uint16_t),
    };
    ESP_ERROR_CHECK(spi_bus_initialize(LCD_HOST, &buscfg, SPI_DMA_CH_AUTO));

    ESP_LOGI(TAG, "Install panel IO");
    const esp_lcd_panel_io_spi_config_t io_config =
        ILI9341_PANEL_IO_SPI_CONFIG(PIN_NUM_LCD_CS, PIN_NUM_LCD_DC, NULL, NULL);
    // Attach the LCD to the SPI bus
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_HOST, &io_config, &lcd_io));

    ESP_LOGI(TAG, "Install ili9341 panel driver");
    const esp_lcd_panel_dev_config_t panel_config = {
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
        .color_space = ESP_LCD_COLOR_SPACE_BGR,
#elif ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(6, 0, 0)
        .rgb_endian = LCD_RGB_ENDIAN_BGR,
#else
        .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_BGR,
#endif
        .bits_per_pixel = LCD_BIT_PER_PIXEL,
        .reset_gpio_num = PIN_NUM_LCD_RST,
    };
    ESP_ERROR_CHECK(esp_lcd_new_panel_ili9341(lcd_io, &panel_config, &lcd_panel));
    ESP_ERROR_CHECK(esp_lcd_panel_reset(lcd_panel));
    ESP_ERROR_CHECK(esp_lcd_panel_init(lcd_panel));
    ESP_ERROR_CHECK(esp_lcd_panel_swap_xy(lcd_panel, true));
    ESP_ERROR_CHECK(esp_lcd_panel_mirror(lcd_panel, true, true));
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0)
    ESP_ERROR_CHECK(esp_lcd_panel_disp_off(lcd_panel, false));
#else
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(lcd_panel, true));
#endif
}


void Gui::initTouch(void)
{
    /* Initilize I2C */
    const i2c_master_bus_config_t i2c_config = {
        .i2c_port = TOUCH_I2C_NUM,
        .sda_io_num = TOUCH_I2C_SDA,
        .scl_io_num = TOUCH_I2C_SCL,
        .clk_source = I2C_CLK_SRC_DEFAULT,
    };
     
    ESP_ERROR_CHECK(i2c_new_master_bus(&i2c_config, &i2c_handle));

    /* Initialize touch HW */
    const esp_lcd_touch_config_t tp_cfg = {
        .x_max = LCD_V_RES,
        .y_max = LCD_H_RES,
        .rst_gpio_num = GPIO_NUM_NC, // Shared with LCD reset
        .int_gpio_num = TOUCH_GPIO_INT,
        .levels = {
            .reset = 1,
            .interrupt = 0,
        },
        .flags = {
            .swap_xy = 1,
            .mirror_x = 0,
            .mirror_y = 1,
        },
    };
    esp_lcd_panel_io_i2c_config_t tp_io_config = ESP_LCD_TOUCH_IO_I2C_FT6x36_CONFIG();
    tp_io_config.scl_speed_hz = TOUCH_I2C_CLK_HZ;
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_handle, &tp_io_config, &tp_io_handle));
    // we need to wait so the i2c has time to initialize
    vTaskDelay(pdMS_TO_TICKS(50));
    ESP_ERROR_CHECK(esp_lcd_touch_new_i2c_ft6x36(tp_io_handle, &tp_cfg, &touch_handle));
}

void Gui::init() {
    initDisplay();
    initTouch();
    
    ESP_ERROR_CHECK(app_lvgl_init(0));
    
    app_main_display();
}
